#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.azurerm_express_route_circuit.er_circuit will be created
  + resource "azurerm_express_route_circuit" "er_circuit" {
      + allow_classic_operations            = false
      + bandwidth_in_mbps                   = 50
      + id                                  = (known after apply)
      + location                            = "eastus"
      + name                                = "cq-circuit"
      + peering_location                    = "Silicon Valley"
      + resource_group_name                 = "cq-network-rg"
      + service_key                         = (sensitive value)
      + service_provider_name               = "Equinix"
      + service_provider_provisioning_state = (known after apply)
      + tags                                = {
          + "environment" = "Test"
        }

      + sku {
          + family = "MeteredData"
          + tier   = "Standard"
        }
    }

  # module.demo.azurerm_express_route_gateway.gateway will be created
  + resource "azurerm_express_route_gateway" "gateway" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "cq-er-gateway"
      + resource_group_name = "cq-network-rg"
      + scale_units         = 1
      + tags                = {
          + "environment" = "Test"
        }
      + virtual_hub_id      = (known after apply)
    }

  # module.demo.azurerm_express_route_port.er_port will be created
  + resource "azurerm_express_route_port" "er_port" {
      + bandwidth_in_gbps   = 10
      + encapsulation       = "Dot1Q"
      + ethertype           = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + mtu                 = (known after apply)
      + name                = "cq-er-port"
      + peering_location    = "Equinix-Amsterdam-AM5"
      + resource_group_name = "cq-network-rg"

      + link1 {
          + admin_enabled                 = (known after apply)
          + connector_type                = (known after apply)
          + id                            = (known after apply)
          + interface_name                = (known after apply)
          + macsec_cak_keyvault_secret_id = (known after apply)
          + macsec_cipher                 = (known after apply)
          + macsec_ckn_keyvault_secret_id = (known after apply)
          + patch_panel_id                = (known after apply)
          + rack_id                       = (known after apply)
          + router_name                   = (known after apply)
        }

      + link2 {
          + admin_enabled                 = (known after apply)
          + connector_type                = (known after apply)
          + id                            = (known after apply)
          + interface_name                = (known after apply)
          + macsec_cak_keyvault_secret_id = (known after apply)
          + macsec_cipher                 = (known after apply)
          + macsec_ckn_keyvault_secret_id = (known after apply)
          + patch_panel_id                = (known after apply)
          + rack_id                       = (known after apply)
          + router_name                   = (known after apply)
        }
    }

  # module.demo.azurerm_resource_group.network will be created
  + resource "azurerm_resource_group" "network" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "cq-network-rg"
    }

  # module.demo.azurerm_route_filter.route_filter will be created
  + resource "azurerm_route_filter" "route_filter" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "cq-route-filter"
      + resource_group_name = "cq-network-rg"
      + rule                = [
          + {
              + access      = "Allow"
              + communities = [
                  + "12076:52004",
                ]
              + name        = "rule"
              + rule_type   = "Community"
            },
        ]
    }

  # module.demo.azurerm_virtual_hub.virtual_hub will be created
  + resource "azurerm_virtual_hub" "virtual_hub" {
      + address_prefix         = "10.0.1.0/24"
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + location               = "eastus"
      + name                   = "cq-er-virtualhub"
      + resource_group_name    = "cq-network-rg"
      + virtual_wan_id         = (known after apply)
    }

  # module.demo.azurerm_virtual_wan.virtual_wan will be created
  + resource "azurerm_virtual_wan" "virtual_wan" {
      + allow_branch_to_branch_traffic    = true
      + allow_vnet_to_vnet_traffic        = false
      + disable_vpn_encryption            = false
      + id                                = (known after apply)
      + location                          = "eastus"
      + name                              = "cq-er-virtualwan"
      + office365_local_breakout_category = "None"
      + resource_group_name               = "cq-network-rg"
      + type                              = "Standard"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*